labs/student/examples/jaxws/Managers/generated/xml/docLiteralManager.xml

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://server.jaxws.example.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://server.jaxws.example.com/" name="Managers">
<types>
<xsd:schema>
<xsd:import namespace="http://server.jaxws.example.com/" schemaLocation="http://localhost:8080/docLiteralManager?xsd=1"></xsd:import>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://jaxb.dev.java.net/array" schemaLocation="http://localhost:8080/docLiteralManager?xsd=2"></xsd:import>
</xsd:schema>
</types>
<message name="addAirport">
<part name="airport" element="tns:airport"></part>
</message>
<message name="addAirportResponse">
<part name="addAirportResponse" element="tns:addAirportResponse"></part>
</message>
<message name="findNeighbors">
<part name="code" element="tns:code"></part>
</message>
<message name="findNeighborsResponse">
<part name="findNeighborsResponse" element="tns:findNeighborsResponse"></part>
</message>
<portType name="DocumentLiteralAirportManager">
<operation name="addAirport">
<input message="tns:addAirport"></input>
<output message="tns:addAirportResponse"></output>
</operation>
<operation name="findNeighbors">
<input message="tns:findNeighbors"></input>
<output message="tns:findNeighborsResponse"></output>
</operation>
</portType>
<binding name="AirportMgrBinding" type="tns:DocumentLiteralAirportManager">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="addAirport">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
<operation name="findNeighbors">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="Managers">
<port name="AirportMgr" binding="tns:AirportMgrBinding">
<soap:address location="http://localhost:8080/docLiteralManager"></soap:address>
</port>
</service>
</definitions>